Ran Plan for 6 projects:

1. dir: `infra/us-east-1/mgmt/atlantis/acm` workspace: `default`
1. dir: `infra/us-east-1/mgmt/atlantis/key-pair` workspace: `default`
1. dir: `infra/us-east-1/mgmt/atlantis/security-group` workspace: `default`
1. dir: `infra/us-east-1/mgmt/atlantis/alb` workspace: `default`
1. dir: `infra/us-east-1/mgmt/atlantis/ec2` workspace: `default`
1. dir: `infra/us-east-1/mgmt/ecr` workspace: `default`

### 4. dir: `infra/us-east-1/mgmt/atlantis/alb` workspace: `default`
<details><summary>Show Output</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
-/+ destroy and then create replacement
+/- create replacement and then destroy

Terraform will perform the following actions:

  # aws_lb.this[0] must be replaced
-/+ resource "aws_lb" "this" {
!       arn                                                          = "arn:aws:elasticloadbalancing:us-east-1:677160962006:loadbalancer/app/atlantis-mgmt-smartcontracts-alb/648e5a511365f99d" -> (known after apply)
!       arn_suffix                                                   = "app/atlantis-mgmt-smartcontracts-alb/648e5a511365f99d" -> (known after apply)
!       dns_name                                                     = "atlantis-mgmt-smartcontracts-alb-329464703.us-east-1.elb.amazonaws.com" -> (known after apply)
-       enable_cross_zone_load_balancing                             = true -> null
+       enforce_security_group_inbound_rules_on_private_link_traffic = (known after apply)
!       id                                                           = "arn:aws:elasticloadbalancing:us-east-1:677160962006:loadbalancer/app/atlantis-mgmt-smartcontracts-alb/648e5a511365f99d" -> (known after apply)
!       internal                                                     = false -> (known after apply)
!       ip_address_type                                              = "ipv4" -> (known after apply)
!       name                                                         = "atlantis-mgmt-smartcontracts-alb" -> "atlantis-ec2-alb" # forces replacement
+       name_prefix                                                  = (known after apply)
!       security_groups                                              = [
-           "sg-023fc92822411454a",
        ] -> (known after apply)
        tags                                                         = {
            "terraform-aws-modules" = "alb"
        }
!       vpc_id                                                       = "vpc-05d9f25d63d8ffb04" -> (known after apply)
!       zone_id                                                      = "Z35SXDOTRQ7X7K" -> (known after apply)
        # (13 unchanged attributes hidden)

-       access_logs {
-           enabled = false -> null
        }

-       connection_logs {
-           enabled = false -> null
        }

-       subnet_mapping {
-           subnet_id = "subnet-06b0cea9c49f5b5aa" -> null
        }
-       subnet_mapping {
-           subnet_id = "subnet-07b8a937d49c2a72a" -> null
        }

        # (1 unchanged block hidden)
    }

  # aws_lb_listener.this["http-https-redirect"] must be replaced
-/+ resource "aws_lb_listener" "this" {
!       arn               = "arn:aws:elasticloadbalancing:us-east-1:677160962006:listener/app/atlantis-mgmt-smartcontracts-alb/648e5a511365f99d/d272a1aa9789abc6" -> (known after apply)
!       id                = "arn:aws:elasticloadbalancing:us-east-1:677160962006:listener/app/atlantis-mgmt-smartcontracts-alb/648e5a511365f99d/d272a1aa9789abc6" -> (known after apply)
!       load_balancer_arn = "arn:aws:elasticloadbalancing:us-east-1:677160962006:loadbalancer/app/atlantis-mgmt-smartcontracts-alb/648e5a511365f99d" # forces replacement -> (known after apply) # forces replacement
+       ssl_policy        = (known after apply)
        tags              = {
            "terraform-aws-modules" = "alb"
        }
        # (3 unchanged attributes hidden)

!       default_action {
!           order = 1 -> (known after apply)
            # (1 unchanged attribute hidden)

            # (1 unchanged block hidden)
        }
    }

  # aws_lb_listener.this["https"] must be replaced
-/+ resource "aws_lb_listener" "this" {
!       arn               = "arn:aws:elasticloadbalancing:us-east-1:677160962006:listener/app/atlantis-mgmt-smartcontracts-alb/648e5a511365f99d/c84f2ee31ae7433c" -> (known after apply)
!       id                = "arn:aws:elasticloadbalancing:us-east-1:677160962006:listener/app/atlantis-mgmt-smartcontracts-alb/648e5a511365f99d/c84f2ee31ae7433c" -> (known after apply)
!       load_balancer_arn = "arn:aws:elasticloadbalancing:us-east-1:677160962006:loadbalancer/app/atlantis-mgmt-smartcontracts-alb/648e5a511365f99d" # forces replacement -> (known after apply) # forces replacement
        tags              = {
            "terraform-aws-modules" = "alb"
        }
        # (5 unchanged attributes hidden)

!       default_action {
!           order            = 1 -> (known after apply)
            # (2 unchanged attributes hidden)
        }

-       mutual_authentication {
-           ignore_client_certificate_expiry = false -> null
-           mode                             = "off" -> null
        }
    }

  # aws_route53_record.this["A"] will be updated in-place
!   resource "aws_route53_record" "this" {
        id                               = "Z10147571DRRDCJXSER5Y_atlantis-ec2_A"
        name                             = "atlantis-ec2"
        # (6 unchanged attributes hidden)

!       alias {
!           name                   = "atlantis-mgmt-smartcontracts-alb-329464703.us-east-1.elb.amazonaws.com" -> (known after apply)
!           zone_id                = "Z35SXDOTRQ7X7K" -> (known after apply)
            # (1 unchanged attribute hidden)
        }
    }

  # aws_route53_record.this["AAA"] will be updated in-place
!   resource "aws_route53_record" "this" {
        id                               = "Z10147571DRRDCJXSER5Y_atlantis-ec2_AAAA"
        name                             = "atlantis-ec2"
        # (6 unchanged attributes hidden)

!       alias {
!           name                   = "atlantis-mgmt-smartcontracts-alb-329464703.us-east-1.elb.amazonaws.com" -> (known after apply)
!           zone_id                = "Z35SXDOTRQ7X7K" -> (known after apply)
            # (1 unchanged attribute hidden)
        }
    }

  # aws_security_group.this[0] must be replaced
+/- resource "aws_security_group" "this" {
!       arn                    = "arn:aws:ec2:us-east-1:677160962006:security-group/sg-023fc92822411454a" -> (known after apply)
!       description            = "Security group for atlantis-mgmt-smartcontracts-alb application load balancer" -> "Security group for atlantis-ec2-alb application load balancer" # forces replacement
!       egress                 = [
-           {
-               cidr_blocks      = [
-                   "10.100.0.0/16",
                ]
-               description      = ""
-               from_port        = 0
-               ipv6_cidr_blocks = []
-               prefix_list_ids  = []
-               protocol         = "-1"
-               security_groups  = []
-               self             = false
-               to_port          = 0
            },
        ] -> (known after apply)
!       id                     = "sg-023fc92822411454a" -> (known after apply)
!       ingress                = [
-           {
-               cidr_blocks      = [
-                   "0.0.0.0/0",
                ]
-               description      = "HTTP web traffic"
-               from_port        = 80
-               ipv6_cidr_blocks = []
-               prefix_list_ids  = []
-               protocol         = "tcp"
-               security_groups  = []
-               self             = false
-               to_port          = 82
            },
-           {
-               cidr_blocks      = [
-                   "0.0.0.0/0",
                ]
-               description      = "HTTPS web traffic"
-               from_port        = 443
-               ipv6_cidr_blocks = []
-               prefix_list_ids  = []
-               protocol         = "tcp"
-               security_groups  = []
-               self             = false
-               to_port          = 445
            },
        ] -> (known after apply)
!       name                   = "atlantis-mgmt-smartcontracts-alb-20240117195316750200000001" -> (known after apply)
!       name_prefix            = "atlantis-mgmt-smartcontracts-alb-" -> "atlantis-ec2-alb-" # forces replacement
!       owner_id               = "677160962006" -> (known after apply)
        tags                   = {
            "terraform-aws-modules" = "alb"
        }
        # (3 unchanged attributes hidden)
    }

  # aws_vpc_security_group_egress_rule.this["all"] must be replaced
-/+ resource "aws_vpc_security_group_egress_rule" "this" {
!       arn                    = "arn:aws:ec2:us-east-1:677160962006:security-group-rule/sgr-098bd884fb4d2c6ee" -> (known after apply)
!       id                     = "sgr-098bd884fb4d2c6ee" -> (known after apply)
!       security_group_id      = "sg-023fc92822411454a" # forces replacement -> (known after apply) # forces replacement
!       security_group_rule_id = "sgr-098bd884fb4d2c6ee" -> (known after apply)
        tags                   = {
            "terraform-aws-modules" = "alb"
        }
        # (3 unchanged attributes hidden)
    }

  # aws_vpc_security_group_ingress_rule.this["all_http"] must be replaced
-/+ resource "aws_vpc_security_group_ingress_rule" "this" {
!       arn                    = "arn:aws:ec2:us-east-1:677160962006:security-group-rule/sgr-0521ddb8439620bbb" -> (known after apply)
!       id                     = "sgr-0521ddb8439620bbb" -> (known after apply)
!       security_group_id      = "sg-023fc92822411454a" # forces replacement -> (known after apply) # forces replacement
!       security_group_rule_id = "sgr-0521ddb8439620bbb" -> (known after apply)
        tags                   = {
            "terraform-aws-modules" = "alb"
        }
        # (6 unchanged attributes hidden)
    }

  # aws_vpc_security_group_ingress_rule.this["all_https"] must be replaced
-/+ resource "aws_vpc_security_group_ingress_rule" "this" {
!       arn                    = "arn:aws:ec2:us-east-1:677160962006:security-group-rule/sgr-0b821f73104adbb94" -> (known after apply)
!       id                     = "sgr-0b821f73104adbb94" -> (known after apply)
!       security_group_id      = "sg-023fc92822411454a" # forces replacement -> (known after apply) # forces replacement
!       security_group_rule_id = "sgr-0b821f73104adbb94" -> (known after apply)
        tags                   = {
            "terraform-aws-modules" = "alb"
        }
        # (6 unchanged attributes hidden)
    }

Plan: 7 to add, 2 to change, 7 to destroy.

Changes to Outputs:
!   arn                = "arn:aws:elasticloadbalancing:us-east-1:677160962006:loadbalancer/app/atlantis-mgmt-smartcontracts-alb/648e5a511365f99d" -> (known after apply)
!   arn_suffix         = "app/atlantis-mgmt-smartcontracts-alb/648e5a511365f99d" -> (known after apply)
!   dns_name           = "atlantis-mgmt-smartcontracts-alb-329464703.us-east-1.elb.amazonaws.com" -> (known after apply)
!   id                 = "arn:aws:elasticloadbalancing:us-east-1:677160962006:loadbalancer/app/atlantis-mgmt-smartcontracts-alb/648e5a511365f99d" -> (known after apply)
!   listeners          = {
!       http-https-redirect = {
!           arn                   = "arn:aws:elasticloadbalancing:us-east-1:677160962006:listener/app/atlantis-mgmt-smartcontracts-alb/648e5a511365f99d/d272a1aa9789abc6" -> (known after apply)
!           default_action        = [
!               {
!                   order                = 1 -> (known after apply)
!                   target_group_arn     = "" -> null
                    # (6 unchanged attributes hidden)
                },
            ]
!           id                    = "arn:aws:elasticloadbalancing:us-east-1:677160962006:listener/app/atlantis-mgmt-smartcontracts-alb/648e5a511365f99d/d272a1aa9789abc6" -> (known after apply)
!           load_balancer_arn     = "arn:aws:elasticloadbalancing:us-east-1:677160962006:loadbalancer/app/atlantis-mgmt-smartcontracts-alb/648e5a511365f99d" -> (known after apply)
!           mutual_authentication = [] -> (known after apply)
!           ssl_policy            = "" -> (known after apply)
            tags                  = {
                terraform-aws-modules = "alb"
            }
            # (6 unchanged attributes hidden)
        }
!       https               = {
!           arn                   = "arn:aws:elasticloadbalancing:us-east-1:677160962006:listener/app/atlantis-mgmt-smartcontracts-alb/648e5a511365f99d/c84f2ee31ae7433c" -> (known after apply)
!           default_action        = [
!               {
!                   order                = 1 -> (known after apply)
                    # (7 unchanged attributes hidden)
                },
            ]
!           id                    = "arn:aws:elasticloadbalancing:us-east-1:677160962006:listener/app/atlantis-mgmt-smartcontracts-alb/648e5a511365f99d/c84f2ee31ae7433c" -> (known after apply)
!           load_balancer_arn     = "arn:aws:elasticloadbalancing:us-east-1:677160962006:loadbalancer/app/atlantis-mgmt-smartcontracts-alb/648e5a511365f99d" -> (known after apply)
!           mutual_authentication = [
-               {
-                   ignore_client_certificate_expiry = false
-                   mode                             = "off"
-                   trust_store_arn                  = ""
                },
            ] -> (known after apply)
            tags                  = {
                terraform-aws-modules = "alb"
            }
            # (7 unchanged attributes hidden)
        }
    }
!   route53_records    = {
!       A   = {
!           alias                            = [
!               {
!                   name                   = "atlantis-mgmt-smartcontracts-alb-329464703.us-east-1.elb.amazonaws.com" -> (known after apply)
!                   zone_id                = "Z35SXDOTRQ7X7K" -> (known after apply)
                    # (1 unchanged attribute hidden)
                },
            ]
            id                               = "Z10147571DRRDCJXSER5Y_atlantis-ec2_A"
            name                             = "atlantis-ec2"
            # (14 unchanged attributes hidden)
        }
!       AAA = {
!           alias                            = [
!               {
!                   name                   = "atlantis-mgmt-smartcontracts-alb-329464703.us-east-1.elb.amazonaws.com" -> (known after apply)
!                   zone_id                = "Z35SXDOTRQ7X7K" -> (known after apply)
                    # (1 unchanged attribute hidden)
                },
            ]
            id                               = "Z10147571DRRDCJXSER5Y_atlantis-ec2_AAAA"
            name                             = "atlantis-ec2"
            # (14 unchanged attributes hidden)
        }
    }
!   security_group_arn = "arn:aws:ec2:us-east-1:677160962006:security-group/sg-023fc92822411454a" -> (known after apply)
!   security_group_id  = "sg-023fc92822411454a" -> (known after apply)
!   zone_id            = "Z35SXDOTRQ7X7K" -> (known after apply)
```

* :arrow_forward: To **apply** this plan, comment:
    * `atlantis apply -d infra/us-east-1/mgmt/atlantis/alb`
* :put_litter_in_its_place: To **delete** this plan click [here](http://k8s-default-atlantis-91ad56e657-af175fe4f3d67964.elb.us-east-1.amazonaws.com/lock?id=input-output-hk%252Fsc-dev-platform%252Finfra%252Fus-east-1%252Fmgmt%252Fatlantis%252Falb%252Fdefault)
* :repeat: To **plan** this project again, comment:
    * `atlantis plan -d infra/us-east-1/mgmt/atlantis/alb`
</details>
Plan: 7 to add, 2 to change, 7 to destroy.

---
### 6. dir: `infra/us-east-1/mgmt/ecr` workspace: `default`
<details><summary>Show Output</summary>

```diff
time=2024-01-19T10:52:45Z level=warning msg=No double-slash (//) found in source URL /terraform-aws-modules/terraform-aws-ecr.git. Relative paths in downloaded Terraform code may not work.

Initializing the backend...

Successfully configured the backend "s3"! Terraform will automatically
use this backend unless the backend configuration changes.

Initializing provider plugins...
- Finding hashicorp/aws versions matching ">= 4.22.0"...
- Installing hashicorp/aws v5.33.0...
- Installed hashicorp/aws v5.33.0 (signed by HashiCorp)

Terraform has created a lock file .terraform.lock.hcl to record the provider
selections it made above. Include this file in your version control repository
so that Terraform can guarantee to make the same selections by default when
you run "terraform init" in the future.

Terraform has been successfully initialized!
data.aws_caller_identity.current: Reading...
data.aws_partition.current: Reading...
data.aws_partition.current: Read complete after 0s [id=aws]
data.aws_caller_identity.current: Read complete after 0s [id=677160962006]
data.aws_iam_policy_document.repository[0]: Reading...
data.aws_iam_policy_document.repository[0]: Read complete after 0s [id=3792795651]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_ecr_lifecycle_policy.this[0] will be created
+   resource "aws_ecr_lifecycle_policy" "this" {
+       id          = (known after apply)
+       policy      = jsonencode(
            {
+               rules = [
+                   {
+                       action       = {
+                           type = "expire"
                        }
+                       description  = "keep last 20 images"
+                       rulePriority = 10
+                       selection    = {
+                           countNumber = 20
+                           countType   = "imageCountMoreThan"
+                           tagStatus   = "any"
                        }
                    },
+                   {
+                       action       = {
+                           type = "expire"
                        }
+                       description  = "Expire untagged images older than 14 days"
+                       rulePriority = 1
+                       selection    = {
+                           countNumber = 1
+                           countType   = "sinceImagePushed"
+                           countUnit   = "days"
+                           tagStatus   = "untagged"
                        }
                    },
                ]
            }
        )
+       registry_id = (known after apply)
+       repository  = "scde"
    }

  # aws_ecr_repository.this[0] will be created
+   resource "aws_ecr_repository" "this" {
+       arn                  = (known after apply)
+       id                   = (known after apply)
+       image_tag_mutability = "IMMUTABLE"
+       name                 = "scde"
+       registry_id          = (known after apply)
+       repository_url       = (known after apply)
+       tags_all             = {
+           "Environment"  = "mgmt"
+           "Organization" = "iog"
+           "Project"      = "scde"
+           "Terraform"    = "true"
+           "Tribe"        = "smartcontracts"
        }

+       encryption_configuration {
+           encryption_type = "AES256"
+           kms_key         = (known after apply)
        }

+       image_scanning_configuration {
+           scan_on_push = true
        }
    }

  # aws_ecr_repository_policy.this[0] will be created
+   resource "aws_ecr_repository_policy" "this" {
+       id          = (known after apply)
+       policy      = jsonencode(
            {
+               Statement = [
+                   {
+                       Action    = [
+                           "ecr:ListTagsForResource",
+                           "ecr:ListImages",
+                           "ecr:GetRepositoryPolicy",
+                           "ecr:GetLifecyclePolicyPreview",
+                           "ecr:GetLifecyclePolicy",
+                           "ecr:GetDownloadUrlForLayer",
+                           "ecr:GetAuthorizationToken",
+                           "ecr:DescribeRepositories",
+                           "ecr:DescribeImages",
+                           "ecr:DescribeImageScanFindings",
+                           "ecr:BatchGetImage",
+                           "ecr:BatchCheckLayerAvailability",
                        ]
+                       Effect    = "Allow"
+                       Principal = {
+                           AWS = "arn:aws:iam::677160962006:root"
                        }
+                       Sid       = "PrivateReadOnly"
                    },
                ]
+               Version   = "2012-10-17"
            }
        )
+       registry_id = (known after apply)
+       repository  = "scde"
    }

Plan: 3 to add, 0 to change, 0 to destroy.

Changes to Outputs:
+   repository_arn         = (known after apply)
+   repository_registry_id = (known after apply)
+   repository_url         = (known after apply)
```

* :arrow_forward: To **apply** this plan, comment:
    * `atlantis apply -d infra/us-east-1/mgmt/ecr`
* :put_litter_in_its_place: To **delete** this plan click [here](http://k8s-default-atlantis-91ad56e657-af175fe4f3d67964.elb.us-east-1.amazonaws.com/lock?id=input-output-hk%252Fsc-dev-platform%252Finfra%252Fus-east-1%252Fmgmt%252Fecr%252Fdefault)
* :repeat: To **plan** this project again, comment:
    * `atlantis plan -d infra/us-east-1/mgmt/ecr`
</details>
Plan: 3 to add, 0 to change, 0 to destroy.

---
* :fast_forward: To **apply** all unapplied plans from this pull request, comment:
    * `atlantis apply`
* :put_litter_in_its_place: To delete all plans and locks for the PR, comment:
    * `atlantis unlock`